crawler/app/controllers/urls_controller.rb

  def index
    @urls = Url.all
---
SELECT * FROM `urls`

  def show
    @url = Url.find(params[:id])
---
SELECT * FROM `urls` WHERE (`urls`.`id` = 0)

  def edit
    @url = Url.find(params[:id])
---
SELECT * FROM `urls` WHERE (`urls`.`id` = 1)

  def destroy
    @url = Url.find(params[:id])
    @url.destroy
---
SELECT * FROM `urls` WHERE (`urls`.`id` = 1)
DELETE FROM `urls` WHERE `id` = 1